package com.example.myapplication

import android.os.Bundle
import android.view.View
import androidx.fragment.app.Fragment
import androidx.navigation.fragment.findNavController
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView

class MovieListFragment : Fragment(R.layout.fragment_movie_list) {

    private val movies = listOf(
        Movie("Зелена миля", "Френк Дарабонт", "Культова драма «Зелена миля» знята за однойменним романом Стівена Кінга. Головну роль в картині виконав неповторний Том Хенкс. Дії фільму розгортаються в тюрмі «Холодна Гора». Одного разу в блок для засуджених до смертної кари поступає новий в'язень - Джон Коффі, засуджений за вбивство маленьких дівчаток. Коффі привертає увагу начальника цього блоку - Пола Еджкомба. За довгі роки роботи він надивився на різних злочинців, і він трохи розбирається в людях. Пол сумнівається у винності Коффі, адже не дивлячись на його страхітливий вигляд, він наділений наївною добротою і людяністю. Так само з часом з'ясовується, що Джон є володарем дивного дару - здатності зцілювати. Пол розуміє, що така людина ніяк не може бути вбивцею. Але що ж робити, і як допомогти йому? На противагу добру завжди виступає злою. Цього разу воно виступить в образі Персі - молодого тюремника, який обожнює робити життя в'язнів нестерпним.", "https://uakino.club/uploads/post/The%20Green%20Mile/bqwOUBxtK0KWijnSAR5ykWyQamn.jpg"),
        Movie("Втеча з Шоушенка","Френк Дарабонт", "В основу культової драми «Втеча з Шоушенка» лягла повість Стівена Кінга «Ріта Хейворт з Шоушенка». Дії фільму розгортаються в кінці 50-х років минулого століття. Молодого фінансиста Енді Дюфрейна за подвійне вбивство засуджують до довічного ув'язнення, але він категорично заперечує свою причетність до злочину. Свій термін Енді відправляється відбувати в одну з найвідоміших в'язниць - Шоушенк, з якої ще нікому не вдавалося втекти. У в'язниці хлопець стикається з суворими реаліями тюремного світу, світу, де немає місця жалю, а навколо тільки жорстокість. Енді неодноразово ставав жертвою сексуальних домагань, але він пручається до останнього. Незабаром тюремне життя Дюфрейна трохи налагоджується, і він навіть знаходить собі друга, яким став чорношкірий ув'язнений Ред...Один з небагатьох фільмів - \"Втеча з Шоушенка\" - заслуговує перегляду та осмислення", "https://uakino.club/uploads/post/The%20Shawshank%20Redemption/9NdY1WWLZKTjRAdDHrqWz4IdgdR.jpg"),
        Movie("Бійцівський клуб","Девід Фінчер", "Сюжет фільму «Бійцівський клуб»: оповідачем історії є типовий яппі. Йому тридцять і він найманий робітник. Так само він мучиться від безсоння, і не може визначити де сон, а де дійсність. Замість ліків лікар йому пропонує зайнятися спортом і періодично відвідувати групу хворих на рак яєчок. Відвідування даної групи має довести оповідачеві, що таке справжня мука, і щоб він зрозумів що його безсоння в порівнянні з раком сущі дрібниці. Так само наш оповідач мріє про переломний момент, який переверне все його життя. Одного разу в барі він знайомитися з Тайлером Дьорденом, торговцем милом, який володіє значним даром ...", "https://uakino.club/uploads/post/Fight%20Club/imCVaunF2Wl3ZRYOH1XB047sTyb.jpg"),
        Movie("Інтерстеллар", "Крістофер Нолан", "В недалекому майбутньому техногенній людській цивілізації прийшов кінець. Землю вразили посухи, які занапастили більшу частину врожаїв. Залишки зернових пожерли бактерії, піщані бурі знищили родючий шар ґрунту. Держави зникли, людство деградувало до сільських комун, розкиданих по Землі - але навіть їх ледь могла прогодувати висохла планета.", "https://uakino.club/uploads/post/Interstellar/t9HT1HX2YTHeZ62IgyGQwxBv5VW.jpg")
    )

    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        super.onViewCreated(view, savedInstanceState)

        val recyclerView: RecyclerView = view.findViewById(R.id.recyclerView)
        recyclerView.layoutManager = LinearLayoutManager(requireContext())
        recyclerView.adapter = MovieAdapter(movies) { selectedMovie ->
            navigateToMovieDetail(selectedMovie)
        }
    }

    private fun navigateToMovieDetail(movie: Movie) {
        val action = MovieListFragmentDirections.actionMovieListFragmentToMovieDetailFragment(movie)
        findNavController().navigate(action)
    }
}